Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/faq-ajax_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: faq-ajax title: AJAX and APIs permalink: docs/faq-ajax.html layout: docs category: FAQ ---
ja: --- id: faq-ajax title: AJAX と API permalink: docs/faq-ajax.html layout: docs category: FAQ ---

source: ### How can I make an AJAX call?
ja: ### AJAX コールをする方法は？

source: You can use any AJAX library you like with React.
ja: 任意の AJAX ライブラリを React と共に利用可能です。

source: Some popular ones are [Axios](https://github.com/axios/axios), [jQuery AJAX](https://api.jquery.com/jQuery.ajax/), and the browser built-in [window.fetch](https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API).
ja: 人気のあるものとしては、[Axios](https://github.com/axios/axios)、[jQuery AJAX](https://api.jquery.com/jQuery.ajax/)、ブラウザ組み込みの [window.fetch](https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API) などがあります。

source: ### Where in the component lifecycle should I make an AJAX call?
ja: ### コンポーネントのどのライフサイクルで AJAX コールすべきか？

source: You should populate data with AJAX calls in the [`componentDidMount`](/docs/react-component.html#mounting) lifecycle method.
ja: AJAX コールによるデータ取得は [`componentDidMount`](/docs/react-component.html#mounting) のライフサイクルメソッドで行うべきです。

source: This is so you can use `setState` to update your component when the data is retrieved.
ja: データ取得後に `setState` でコンポーネントを更新できるようにするためです。

source: ### Example: Using AJAX results to set local state {#example-using-ajax-results-to-set-local-state}
ja: ### 例：ローカル state に AJAX の通信結果をセットする {#example-using-ajax-results-to-set-local-state}

source: The component below demonstrates how to make an AJAX call in `componentDidMount` to populate local component state.
ja: 下記のコンポーネントは、`componentDidMount` で AJAX コールして得られたデータをローカルコンポーネントの state に流し込んでいます。

source: The example API returns a JSON object like this:
ja: このサンプル API が返す JSON オブジェクトはこのようになります：

source: // Note: it's important to handle errors here
ja: // 補足：コンポーネント内のバグによる例外を隠蔽しないためにも

source: // instead of a catch() block so that we don't swallow // exceptions from actual bugs in components.
ja: // catch()ブロックの代わりにここでエラーハンドリングすることが重要です

source: Here is the equivalent with [Hooks](https://reactjs.org/docs/hooks-intro.html):
ja: こちらが[フック](/docs/hooks-intro.html)による同等版です：
